<?php

return [
    'configuration' => [
        'fpc' => [
            'title'         => 'کش کامل صفحه',
            'info'          => 'تنظیمات کش کامل صفحه را برای بهبود عملکرد پیکربندی کنید.',
            'configuration' => [
                'title' => 'پیکربندی',
                'info'  => 'مدیریت برنامه کش و تنظیمات مرتبط.',
                'fpc'   => [
                    'title'             => 'برنامه کش',
                    'info'              => 'برنامه کشی را که می‌خواهید برای فروشگاه خود استفاده کنید انتخاب کنید.',
                    'cache_application' => [
                        'title'   => 'برنامه کش',
                        'varnish' => [
                            'title'       => 'وارنیش (توصیه شده)',
                            'info'        => 'فعال‌سازی کش وارنیش برای بهبود عملکرد.',
                            'access_list' => [
                                'title' => 'فهرست دسترسی',
                                'info'  => 'آدرس‌های IP جدا شده با کاما که اجازه دسترسی به سرور وارنیش را دارند.',
                            ],
                            'url' => [
                                'title' => 'آدرس میزبان وارنیش',
                                'info'  => 'URL یا IP سرور وارنیش خود را وارد کنید.',
                            ],
                            'backend_url' => [
                                'title' => 'آدرس میزبان بک‌اند',
                                'info'  => 'IP یا نام میزبان سرور بک‌اند که وارنیش به آن متصل می‌شود را وارد کنید (مثلاً localhost).',
                            ],
                            'backend_port' => [
                                'title' => 'پورت میزبان بک‌اند',
                                'info'  => 'پورت سرور بک‌اند که در آن اجرا می‌شود را وارد کنید (پیش‌فرض: 8080).',
                            ],
                            'grace_period' => [
                                'title' => 'دورهٔ اعتبار',
                                'info'  => 'تنظیم کنید که وارنیش تا چه مدت محتوای قدیمی را وقتی بک‌اند کند یا در دسترس نیست، ارائه دهد.',
                            ],
                            'export_vcl' => [
                                'title' => 'خروجی VCL (6.0)',
                                'info'  => 'فایل را به صورت محلی یا در /etc/varnish/default.vcl ذخیره کنید. سپس سرویس وارنیش را راه‌اندازی مجدد کنید.',
                            ],
                        ],
                    ],
                ],
            ],
            'cache_management' => [
                'title'       => 'مدیریت کش',
                'info'        => 'مدیریت و پاکسازی محتوای کش شده.',
                'purge_cache' => [
                    'title'       => 'پاکسازی کش',
                    'info'        => 'کش فروشگاه خود را پاک کنید.',
                    'via_url'     => [
                        'title'        => 'پاکسازی بر اساس URL',
                        'btn'          => 'پاکسازی',
                        'placeholder'  => 'https://www.example.com, https://www.example.com/cat.jpg',
                        'info'         => 'URLهای کامل را با کاما جدا کنید تا ورودی‌های مشخص کش از وارنیش پاک شوند. مسیر و دامنه باید دقیقاً مطابقت داشته باشند.',
                        'confirmation' => 'آیا مطمئن هستید که می‌خواهید کش برای URLهای مشخص شده پاک شود؟',
                    ],
                    'success'         => 'کش با موفقیت برای :urls پاک شد',
                    'failure'         => 'پاکسازی کش برای :urls ناموفق بود',
                    'all_success'     => 'تمام کش با موفقیت پاک شد.',
                    'partial_failure' => 'پاکسازی URLهای زیر ناموفق بود: :urls',
                    'exception'       => 'خطا رخ داد: :message',
                    'url_required'    => 'وارد کردن URL برای پاکسازی ضروری است.',
                    'unknown_url'     => 'URL ناشناخته',
                ],
                'purge_full_cache' => [
                    'title'        => 'پاکسازی کامل',
                    'placeholder'  => 'https://www.example.com/cat.jpg/foo/bar',
                    'btn'          => 'پاکسازی همه',
                    'info'         => 'این عمل تمام ورودی‌های کش وارنیش را پاک می‌کند. با احتیاط استفاده کنید چون ممکن است به طور موقت عملکرد را تحت تاثیر قرار دهد.',
                    'confirmation' => 'آیا مطمئن هستید که می‌خواهید کل کش پاک شود؟ این عمل تمام محتوای کش شده را حذف می‌کند و ممکن است به طور موقت عملکرد را تحت تاثیر قرار دهد.',
                ],
            ],
        ],
    ],
];
